Repository: humblefoundation-zz/translation-support-files
Catalog: quran-imported/Muhsin Khan.tmx
Source language: ar
Languages: en

source: وما أرسلنا من قبلك إلا رجالا نوحي إليهم فاسألوا أهل الذكر إن كنتم لا تعلمون
en: And We sent not (as Our Messengers) before you (O Muhammad صلى الله عليه و سلم) any but men, whom We sent revelation, (to preach and invite mankind to believe in the Oneness of Allah). So ask (you, O pagans of Makkah) of those who know the Scripture [learned men of the Taurat (Torah) and the Injeel (Gospel)], if you know not.

source: بالبينات والزبر وأنزلنا إليك الذكر لتبين للناس ما نزل إليهم ولعلهم يتفكرون
en: With clear signs and Books (We sent the Messengers). And We have also sent down unto you (O Muhammad صلى الله عليه و سلم) the Dhikr [reminder and the advice (i.e. the Qur'an)], that you may explain clearly to men what is sent down to them, and that they may give thought.

source: أفأمن الذين مكروا السيئات أن يخسف الله بهم الأرض أو يأتيهم العذاب من حيث لا يشعرون
en: Do then those who devise evil plots feel secure that Allah will not sink them into the earth, or that the torment will not seize them from directions they perceive not?

source: أو يأخذهم في تقلبهم فما هم بمعجزين
en: Or that He may catch them in the midst of their going to and fro (in their jobs), so that there be no escape for them (from Allah's punishment)?

source: أو يأخذهم على تخوف فإن ربكم لرءوف رحيم
en: Or that He may catch them with gradual wasting (of their wealth and health). Truly! Your Lord is indeed full of Kindness, Most Merciful?

source: أولم يروا إلى ما خلق الله من شيء يتفيأ ظلاله عن اليمين والشمائل سجدا لله وهم داخرون
en: Have they not observed things that Allah has created: (how) their shadows incline to the right and to the left, making prostration unto Allah, and they are lowly?

source: ولله يسجد ما في السماوات وما في الأرض من دابة والملائكة وهم لا يستكبرون
en: And to Allah prostrate all that is in the heavens and all that is in the earth, of the moving (living) creatures and the angels, and they are not proud [i.e. they worship their Lord (Allah) with humility].

source: يخافون ربهم من فوقهم ويفعلون ما يؤمرون
en: They fear their Lord above them, and they do what they are commanded.

source: وقال الله لا تتخذوا إلهين اثنين إنما هو إله واحد فإياي فارهبون
en: And Allah said (O mankind!): "Take not ilahain (two gods in worship). Verily, He (Allah) is (the) only One Ilah (God). Then, fear Me (Allah جل جلاله) much [and Me (Alone), i.e. be away from all kinds of sins and evil deeds that Allah has forbidden and do all that Allah has ordained and worship none but Allah] .

source: وله ما في السماوات والأرض وله الدين واصبا أفغير الله تتقون
en: To Him belongs all that is in the heavens and (all that is in) the earth and Ad-Din Wasiba is His [(i.e. perpetual sincere obedience to Allah is obligatory). None has the right to be worshipped but Allah)]. Will you then fear any other than Allah?

source: وما بكم من نعمة فمن الله ثم إذا مسكم الضر فإليه تجأرون
en: And whatever of blessings and good things you have, it is from Allah. Then, when harm touches you, unto Him you cry aloud for help.

source: ثم إذا كشف الضر عنكم إذا فريق منكم بربهم يشركون
en: Then, when He has removed the harm from you, behold! some of you associate others in worship with their Lord (Allah).

source: ليكفروا بما آتيناهم فتمتعوا فسوف تعلمون
en: So (as a result of that) they deny (with ungratefulness) that (Allah's Favours) which We have bestowed on them! Then enjoy yourselves (your short stay), but you will come to know (with regrets).

source: ويجعلون لما لا يعلمون نصيبا مما رزقناهم تالله لتسألن عما كنتم تفترون
en: And they assign a portion of that which We have provided them unto what they know not (false deities). By Allah, you shall certainly be questioned about (all) that you used to fabricate.

source: ويجعلون لله البنات سبحانه ولهم ما يشتهون
en: And they assign daughters unto Allah! - Glorified (and Exalted) is He above all that they associate with Him! And unto themselves what they desire;

source: وإذا بشر أحدهم بالأنثى ظل وجهه مسودا وهو كظيم
en: And when the news of (the birth of) a female (child) is brought to any of them, his face becomes dark, and he is filled with inward grief!

source: يتوارى من القوم من سوء ما بشر به أيمسكه على هون أم يدسه في التراب ألا ساء ما يحكمون
en: He hides himself from the people because of the evil of that whereof he has been informed. Shall he keep her with dishonour or bury her in the earth ? Certainly, evil is their decision.

source: للذين لا يؤمنون بالآخرة مثل السوء ولله المثل الأعلى وهو العزيز الحكيم
en: For those who believe not in the Hereafter is an evil description, and for Allah is the highest description. And He is the All-Mighty, the All-Wise.

source: ولو يؤاخذ الله الناس بظلمهم ما ترك عليها من دابة ولكن يؤخرهم إلى أجل مسمى فإذا جاء أجلهم لا يستأخرون ساعة ولا يستقدمون
en: And if Allah were to seize mankind for their wrong-doing, He would not leave on it (the earth) a single moving (living) creature, but He postpones them for an appointed term and when their term comes, neither can they delay nor can they advance it an hour (or a moment).

source: ويجعلون لله ما يكرهون وتصف ألسنتهم الكذب أن لهم الحسنى لا جرم أن لهم النار وأنهم مفرطون
en: They assign to Allah that which they dislike (for themselves), and their tongues assert the falsehood that the better things will be theirs. No doubt for them is the Fire, and they will be the first to be hastened on into it, and left there neglected. (Tafsir Al-Qurtubi)

source: تالله لقد أرسلنا إلى أمم من قبلك فزين لهم الشيطان أعمالهم فهو وليهم اليوم ولهم عذاب أليم
en: By Allah, We indeed sent (Messengers) to the nations before you (O Muhammad صلى الله عليه و سلم), but Shaitan (Satan) made their deeds fair-seeming to them. So he (Satan) is their Wali (helper) today (i.e. in this world), and theirs will be a painful torment.

source: وما أنزلنا عليك الكتاب إلا لتبين لهم الذي اختلفوا فيه وهدى ورحمة لقوم يؤمنون
en: And We have not sent down the Book (the Qur'an) to you (O Muhammad صلى الله عليه و سلم), except that you may explain clearly unto them those things in which they differ, and (as) a guidance and a mercy for a folk who believe.

source: والله أنزل من السماء ماء فأحيا به الأرض بعد موتها إن في ذلك لآية لقوم يسمعون
en: And Allah sends down water (rain) from the sky, then He revives the earth therewith after its death. Verily, in this is a sign (clear proof) for people who listen (obey Allah).

source: وإن لكم في الأنعام لعبرة نسقيكم مما في بطونه من بين فرث ودم لبنا خالصا سائغا للشاربين
en: And verily! In the cattle, there is a lesson for you. We give you to drink of that which is in their bellies, from between excretions and blood, pure milk; palatable to the drinkers.

source: ومن ثمرات النخيل والأعناب تتخذون منه سكرا ورزقا حسنا إن في ذلك لآية لقوم يعقلون
en: And from the fruits of date-palms and grapes, you derive strong drink and a goodly provision. Verily, therein is indeed a sign for people who have wisdom.

source: وأوحى ربك إلى النحل أن اتخذي من الجبال بيوتا ومن الشجر ومما يعرشون
en: And your Lord inspired the bees, saying: "Take you habitations in the mountains and in the trees and in what they erect.

source: ثم كلي من كل الثمرات فاسلكي سبل ربك ذللا يخرج من بطونها شراب مختلف ألوانه فيه شفاء للناس إن في ذلك لآية لقوم يتفكرون
en: "Then, eat of all fruits, and follow the ways of your Lord made easy (for you)." There comes forth from their bellies, a drink of varying colour wherein is healing for men. Verily, in this is indeed a sign for people who think.

source: والله خلقكم ثم يتوفاكم ومنكم من يرد إلى أرذل العمر لكي لا يعلم بعد علم شيئا إن الله عليم قدير
en: And Allah has created you and then He will cause you to die; and of you there are some who are sent back to senility, so that they know nothing after having known (much). Truly! Allah is All-Knowing, All-Powerful.

source: والله فضل بعضكم على بعض في الرزق فما الذين فضلوا برادي رزقهم على ما ملكت أيمانهم فهم فيه سواء أفبنعمة الله يجحدون
en: And Allah has preferred some of you above others in wealth and properties. Then, those who are preferred will by no means hand over their wealth and properties to those (slaves) whom their right hands possess, so that they may be equal with them in respect thereof . Do they then deny the Favour of Allah?

source: والله جعل لكم من أنفسكم أزواجا وجعل لكم من أزواجكم بنين وحفدة ورزقكم من الطيبات أفبالباطل يؤمنون وبنعمت الله هم يكفرون
en: And Allah has made for you Azwaj (mates or wives) of your own kind, and has made for you, from your wives, sons and grandsons, and has bestowed on you good provision. Do they then believe in false deities and deny the Favour of Allah (by not worshipping Allah Alone).

source: ويعبدون من دون الله ما لا يملك لهم رزقا من السماوات والأرض شيئا ولا يستطيعون
en: And they worship others besides Allah - such as do not and cannot own any provision for them from the heavens or the earth.

source: فلا تضربوا لله الأمثال إن الله يعلم وأنتم لا تعلمون
en: So put not forward similitudes for Allah (as there is nothing similar to Him, nor He resembles anything). Truly! Allah knows and you know not.

source: ضرب الله مثلا عبدا مملوكا لا يقدر على شيء ومن رزقناه منا رزقا حسنا فهو ينفق منه سرا وجهرا هل يستوون الحمد لله بل أكثرهم لا يعلمون
en: Allah puts forward the example of (two men - a believer and a disbeliever); a slave (disbeliever) under the possession of another, he has no power of any sort, and (the other), a man (believer) on whom We have bestowed a good provision from Us, and he spends thereof secretly and openly. Can they be equal? (By no means). All the praises and thanks are to Allah. Nay! (But) most of them know not.

source: وضرب الله مثلا رجلين أحدهما أبكم لا يقدر على شيء وهو كل على مولاه أينما يوجهه لا يأت بخير هل يستوي هو ومن يأمر بالعدل وهو على صراط مستقيم
en: And Allah puts forward (another) example of two men, one of them dumb, who has no power over anything (disbeliever), and he is a burden on his master; whichever way he directs him, he brings no good. Is such a man equal to one (believer in the Islamic Monotheism) who commands justice, and is himself on the Straight Path?

source: ولله غيب السماوات والأرض وما أمر الساعة إلا كلمح البصر أو هو أقرب إن الله على كل شيء قدير
en: And to Allah belongs the Unseen of the heavens and the earth. And the matter of the Hour is not but as a twinkling of the eye, or even nearer. Truly! Allah is Able to do all things.

source: والله أخرجكم من بطون أمهاتكم لا تعلمون شيئا وجعل لكم السمع والأبصار والأفئدة لعلكم تشكرون
en: And Allah has brought you out from the wombs of your mothers while you know nothing. And He gave you hearing, sight, and hearts that you might give thanks (to Allah).

source: ألم يروا إلى الطير مسخرات في جو السماء ما يمسكهن إلا الله إن في ذلك لآيات لقوم يؤمنون
en: Do they not see the birds held (flying) in the midst of the sky? None holds them but Allah [none gave them the ability to fly but Allah]. Verily, in this are clear Ayat (proofs and signs) for people who believe (in the Oneness of Allah).

source: والله جعل لكم من بيوتكم سكنا وجعل لكم من جلود الأنعام بيوتا تستخفونها يوم ظعنكم ويوم إقامتكم ومن أصوافها وأوبارها وأشعارها أثاثا ومتاعا إلى حين
en: And Allah has made for you in your homes an abode, and made for you out of the hides of the cattle (tents for) dwelling, which you find so light (and handy) when you travel and when you stay (in your travels); and of their wool, fur, and hair (sheep wool, camel fur, and goat hair), furnishings and articles of convenience (e.g. carpets, blankets), comfort for a while.

source: والله جعل لكم مما خلق ظلالا وجعل لكم من الجبال أكنانا وجعل لكم سرابيل تقيكم الحر وسرابيل تقيكم بأسكم كذلك يتم نعمته عليكم لعلكم تسلمون
en: And Allah has made for you out of that which He has created shades, and has made for you places of refuge in the mountains, and has made for you garments to protect you from the heat (and cold), and coats of mail to protect you from your (mutual) violence. Thus does He perfect His Favour unto you, that you may submit yourselves to His Will (in Islam).

source: فإن تولوا فإنما عليك البلاغ المبين
en: Then, if they turn away, your duty (O Muhammad صلى الله عليه و سلم) is only to convey (the Message) in a clear way.

source: يعرفون نعمت الله ثم ينكرونها وأكثرهم الكافرون
en: They recognise the Grace of Allah, yet they deny it (by worshipping others besides Allah) and most of them are disbelievers (deny the Prophethood of Muhammad صلى الله عليه و سلم).

source: ويوم نبعث من كل أمة شهيدا ثم لا يؤذن للذين كفروا ولا هم يستعتبون
en: And (remember) the Day when We shall raise up from each nation a witness (their Messenger), then, those who disbelieved will not be given leave (to put forward excuses), nor will they be allowed (to return to the world) to repent and ask for Allah's Forgiveness (of their sins).

source: وإذا رأى الذين ظلموا العذاب فلا يخفف عنهم ولا هم ينظرون
en: And when those who did wrong (the disbelievers) will see the torment, then it will not be lightened unto them, nor will they be given respite.

source: وإذا رأى الذين أشركوا شركاءهم قالوا ربنا هؤلاء شركاؤنا الذين كنا ندعو من دونك فألقوا إليهم القول إنكم لكاذبون
en: And when those who associated partners with Allah see their (Allah's so-called) partners, they will say: "Our Lord! These are our partners whom we used to invoke besides you." But they will throw back their word at them (and say): "Surely! You indeed are liars!"

source: وألقوا إلى الله يومئذ السلم وضل عنهم ما كانوا يفترون
en: And they will offer (their full) submission to Allah (Alone) on that Day, and their invented false deities [all that they used to invoke besides Allah, e.g. idols, saints, priests, monks, angels, jinn, Jibril (Gabriel), Messengers] will vanish from them.

source: الذين كفروا وصدوا عن سبيل الله زدناهم عذابا فوق العذاب بما كانوا يفسدون
en: Those who disbelieved and hinder (men) from the Path of Allah, for them We will add torment to the torment because they used to spread corruption [by disobeying Allah themselves, as well as ordering others (mankind) to do so].

source: ويوم نبعث في كل أمة شهيدا عليهم من أنفسهم وجئنا بك شهيدا على هؤلاء ونزلنا عليك الكتاب تبيانا لكل شيء وهدى ورحمة وبشرى للمسلمين
en: And (remember) the Day when We shall raise up from every nation a witness against them from amongst themselves. And We shall bring you (O Muhammad صلى الله عليه و سلم) as a witness against these. And We have sent down to you the Book (the Qur'an) as an exposition of everything, a guidance, a mercy, and glad tidings for those who have submitted themselves (to Allah as Muslims).

source: إن الله يأمر بالعدل والإحسان وإيتاء ذي القربى وينهى عن الفحشاء والمنكر والبغي يعظكم لعلكم تذكرون
en: Verily, Allah enjoins Al-'Adl (i.e. justice and worshipping none but Allah Alone - Islamic Monotheism) and Al-Ihsan [i.e. to be patient in performing your duties to Allah, totally for Allah's sake and in accordance with the Sunnah (legal ways) of the Prophet صلى الله عليه وسلم in a perfect manner], and giving (help) to kith and kin (i.e. all that Allah has ordered you to give them e.g., wealth, visiting, looking after them, or any other kind of help), and forbids Al-Fahsha' (i.e all evil deeds, e.g. illegal sexual acts, disobedience of parents, polytheism, to tell lies, to give false witness, to kill a life without right), and Al-Munkar (i.e all that is prohibited by Islamic law: polytheism of every kind, disbelief and every kind of evil deeds), and Al-Baghy (i.e. all kinds of oppression). He admonishes you, that you may take heed.

source: وأوفوا بعهد الله إذا عاهدتم ولا تنقضوا الأيمان بعد توكيدها وقد جعلتم الله عليكم كفيلا إن الله يعلم ما تفعلون
en: And fulfil the Covenant of Allah (Bai'ah: pledge for Islam) when you have covenanted, and break not the oaths after you have confirmed them - and indeed you have appointed Allah your surety. Verily! Allah knows what you do.

source: ولا تكونوا كالتي نقضت غزلها من بعد قوة أنكاثا تتخذون أيمانكم دخلا بينكم أن تكون أمة هي أربى من أمة إنما يبلوكم الله به وليبينن لكم يوم القيامة ما كنتم فيه تختلفون
en: And be not like her who undoes the thread which she has spun, after it has become strong, by taking your oaths as a means of deception among yourselves, lest a nation should be more numerous than another nation. Allah only tests you by this [i.e who obeys Allah and fulfils Allah's Covenant and who disobeys Allah and breaks Allah's Covenant]. And on the Day of Resurrection, He will certainly make clear to you that wherein you used to differ [i.e. a believer confesses and believes in the Oneness of Allah and in the Prophethood of Prophet Muhammad صلى الله عليه و سلم which the disbeliever denies and that is their difference amongst them in the life of this world] .

source: ولو شاء الله لجعلكم أمة واحدة ولكن يضل من يشاء ويهدي من يشاء ولتسألن عما كنتم تعملون
en: And had Allah willed, He could have made you (all) one nation, but He sends astray whom He wills and guides whom He wills. But you shall certainly be called to account for what you used to do.

source: ولا تتخذوا أيمانكم دخلا بينكم فتزل قدم بعد ثبوتها وتذوقوا السوء بما صددتم عن سبيل الله ولكم عذاب عظيم
en: And make not your oaths a means of deception among yourselves, lest a foot should slip after being firmly planted, and you may have to taste the evil (punishment in this world) of having hindered (men) from the Path of Allah (i.e. Belief in the Oneness of Allah and His Messenger, Muhammad صلى الله عليه و سلم), and yours will be a great torment (i.e. the Fire of Hell in the Hereafter).

source: ولا تشتروا بعهد الله ثمنا قليلا إنما عند الله هو خير لكم إن كنتم تعلمون
en: And purchase not a small gain at the cost of Allah's Covenant. Verily! What is with Allah is better for you if you did but know.

source: ما عندكم ينفد وما عند الله باق ولنجزين الذين صبروا أجرهم بأحسن ما كانوا يعملون
en: Whatever is with you, will be exhausted, and whatever is with Allah (of good deeds) will remain. And those who are patient, We will certainly pay them a reward in proportion to the best of what they used to do .

source: من عمل صالحا من ذكر أو أنثى وهو مؤمن فلنحيينه حياة طيبة ولنجزينهم أجرهم بأحسن ما كانوا يعملون
en: Whoever works righteousness - whether male or female - while he (or she) is a true believer (of Islamic Monotheism) verily, to him We will give a good life (in this world with respect, contentment and lawful provision), and We shall pay them certainly a reward in proportion to the best of what they used to do (i.e. Paradise in the Hereafter).

source: فإذا قرأت القرآن فاستعذ بالله من الشيطان الرجيم
en: So when you want to recite the Qur'an, seek refuge with Allah from Shaitan (Satan), the outcast (the cursed one).

source: إنه ليس له سلطان على الذين آمنوا وعلى ربهم يتوكلون
en: Verily! He has no power over those who believe and put their trust only in their Lord (Allah).

source: إنما سلطانه على الذين يتولونه والذين هم به مشركون
en: His power is only over those who obey and follow him (Satan), and those who join partners with Him (Allah i.e. those who are Mushrikun i.e. polytheists. See Verse 6:121).

source: وإذا بدلنا آية مكان آية والله أعلم بما ينزل قالوا إنما أنت مفتر بل أكثرهم لا يعلمون
en: And when We change a Verse (of the Qur'an,) in place of another - and Allah knows best what He sends down - they (the disbelievers) say: "You (O Muhammad صلى الله عليه و سلم) are but a Muftari! (forger, liar)." Nay, but most of them know not.

source: قل نزله روح القدس من ربك بالحق ليثبت الذين آمنوا وهدى وبشرى للمسلمين
en: Say (O Muhammad صلى الله عليه و سلم) Ruh-ul-Qudus [Jibril (Gabriel)] has brought it (the Qur'an) down from your Lord with truth, that it may make firm and strengthen (the Faith of) those who believe, and as a guidance and glad tidings to those who have submitted (to Allah as Muslims).

source: ولقد نعلم أنهم يقولون إنما يعلمه بشر لسان الذي يلحدون إليه أعجمي وهذا لسان عربي مبين
en: And indeed We know that they (polytheists and pagans) say: "It is only a human being who teaches him (Muhammad صلى الله عليه و سلم)." The tongue of the man they refer to is foreign, while this (the Qur'an) is a clear Arabic tongue.

source: إن الذين لا يؤمنون بآيات الله لا يهديهم الله ولهم عذاب أليم
en: Verily! Those who believe not in the Ayat (proofs, evidence, verses, lessons, signs, revelations, etc.) of Allah, Allah will not guide them and theirs will be a painful torment.

source: إنما يفتري الكذب الذين لا يؤمنون بآيات الله وأولئك هم الكاذبون
en: It is only those who believe not in the Ayat (proofs, evidence, verses, lessons, signs, revelations, etc.) of Allah, who fabricate falsehood, and it is they who are liars.

source: من كفر بالله من بعد إيمانه إلا من أكره وقلبه مطمئن بالإيمان ولكن من شرح بالكفر صدرا فعليهم غضب من الله ولهم عذاب عظيم
en: Whoever disbelieved in Allah after his belief, except him who is forced thereto and whose heart is at rest with Faith; but such as open their breasts to disbelief, on them is wrath from Allah, and theirs will be a great torment.

source: ذلك بأنهم استحبوا الحياة الدنيا على الآخرة وأن الله لا يهدي القوم الكافرين
en: That is because they loved and preferred the life of this world over that of the Hereafter. And Allah guides not the people who disbelieve.

source: أولئك الذين طبع الله على قلوبهم وسمعهم وأبصارهم وأولئك هم الغافلون
en: They are those upon whose hearts, hearing (ears) and sight (eyes) Allah has set a seal. And they are the heedless!

source: لا جرم أنهم في الآخرة هم الخاسرون
en: No doubt, in the Hereafter, they will be the losers.

source: ثم إن ربك للذين هاجروا من بعد ما فتنوا ثم جاهدوا وصبروا إن ربك من بعدها لغفور رحيم
en: Then, verily! Your Lord - for those who emigrated after they had been put to trials and thereafter strove hard and fought (for the Cause of Allah) and were patient, verily, your Lord afterward is, Oft-Forgiving, Most Merciful.

source: يوم تأتي كل نفس تجادل عن نفسها وتوفى كل نفس ما عملت وهم لا يظلمون
en: (Remember) the Day when every person will come up pleading for himself, and every one will be paid in full for what he did (good or evil, belief or disbelief in the life of this world) and they will not be dealt with unjustly.

source: وضرب الله مثلا قرية كانت آمنة مطمئنة يأتيها رزقها رغدا من كل مكان فكفرت بأنعم الله فأذاقها الله لباس الجوع والخوف بما كانوا يصنعون
en: And Allah puts forward the example of a township (Makkah), that dwelt secure and well-content: its provision coming to it in abundance from every place, but it (its people) denied the Favours of Allah (with ungratefulness). So Allah made it taste extreme of hunger (famine) and fear, because of that (evil, i.e. denying Prophet Muhammad صلى الله عليه و سلم) which they (its people) used to do .

source: ولقد جاءهم رسول منهم فكذبوه فأخذهم العذاب وهم ظالمون
en: And verily, there had come unto them a Messenger (Muhammad صلى الله عليه و سلم) from among themselves, but they denied him, so the torment overtook them while they were Zalimun (polytheists and wrong-doers).

source: فكلوا مما رزقكم الله حلالا طيبا واشكروا نعمت الله إن كنتم إياه تعبدون
en: So eat of the lawful and good food which Allah has provided for you. And be grateful for the Favour of Allah, if it is He Whom you worship.

source: إنما حرم عليكم الميتة والدم ولحم الخنزير وما أهل لغير الله به فمن اضطر غير باغ ولا عاد فإن الله غفور رحيم
en: He has forbidden you only Al-Maitah (meat of a dead animal), blood, the flesh of swine, and any animal which is slaughtered as a sacrifice for others than Allah (or has been slaughtered for idols or on which Allah's Name has not been mentioned while slaughtering). But if one is forced by necessity, without wilful disobedience, and not transgressing, - then, Allah is Oft-Forgiving, Most Merciful.

source: ولا تقولوا لما تصف ألسنتكم الكذب هذا حلال وهذا حرام لتفتروا على الله الكذب إن الذين يفترون على الله الكذب لا يفلحون
en: And say not concerning that which your tongues put forth falsely: "This is lawful and this is forbidden," so as to invent lies against Allah. Verily, those who invent lies against Allah will never prosper.
